fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	
	Если Объект.ЭтоНовый() Тогда 
		НаименованиеЗаявки = "Новый документ №"+Объект.Номер;
		СообщениеНоваяЗаявка = СтрШаблон("Новая заявка на обслуживание клиента № %1 от %2. Дата проведения работ % 3 время начала работ (план) %4",
		Объект.Номер,Объект.Дата,Объект.ДатаПроведенияРабот,Объект.ВремяНачалаРаботПлан);
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовыйЭлемент.Наименование = НаименованиеЗаявки;
		НовыйЭлемент.ТекстСообщения = СообщениеНоваяЗаявка;
		НовыйЭлемент.Записать();
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
			|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
			|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
			|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
			
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
			
		РезультатЗапроса = Запрос.Выполнить();
			
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДатаДокумента = ВыборкаДетальныеЗаписи.Дата;
			СпециалистДокумента = ВыборкаДетальныеЗаписи.Специалист;
			ВремяНачалаРаботДокумента = ВыборкаДетальныеЗаписи.ВремяНачалаРаботПлан;
			ДатаПроведенияРаботДокумента = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот;
		КонецЦикла;
		
		ЕстьИзменение = Ложь;
		НаименованиеИзменения = "Изменение документа №"+Объект.Номер;
		СообщениеОбИзменении = "В документе обслуживание клиента №"+Объект.Номер+" были изменены: ";
			
		Если ДатаДокумента <> Объект.Дата Тогда 
			ЕстьИзменение = Истина;
			СообщениеОбИзменении = СообщениеОбИзменении + " Дата документа на "+ Объект.Дата +"; ";
		КонецЕсли; 
		Если СпециалистДокумента <> Объект.Специалист Тогда 
			ЕстьИзменение = Истина;
			СообщениеОбИзменении = СообщениеОбИзменении + " Специалист на "+ Объект.Специалист +"; ";
		КонецЕсли; 	
		Если ВремяНачалаРаботДокумента <> Объект.ВремяНачалаРаботПлан Тогда 
			ЕстьИзменение = Истина;
			СообщениеОбИзменении = СообщениеОбИзменении + " Время начала работ (план) на "+ Объект.ВремяНачалаРаботПлан +"; ";
		КонецЕсли; 
		Если ДатаПроведенияРаботДокумента <> Объект.ДатаПроведенияРабот Тогда 
			ЕстьИзменение = Истина;
			СообщениеОбИзменении = СообщениеОбИзменении + " Дата проведения работ на "+ Объект.ДатаПроведенияРабот;
		КонецЕсли; 
		
		Если ЕстьИзменение Тогда 
			НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			НовыйЭлемент.Наименование = НаименованиеИзменения;
			НовыйЭлемент.ТекстСообщения = СообщениеОбИзменении;
			НовыйЭлемент.Записать();
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
